Tekla Open API Reference for Tekla Structures 2025
AnalysisRestraintData Constructor
 Creates a new instance of an analysis restraint data.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public AnalysisRestraintData()
Public Sub New
See Also
Reference
AnalysisRestraintData Class
Tekla.Structures.Analysis Namespace